source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/VotuporangaSP.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<GerarNfse versao="1.00">
			<Descricao>Gerar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao>https://votuporanga.prefeitura.rlz.com.br/webservices/nfse/server.php?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://web.votuporanga.sp.gov.br/amfphp/services/RLZ/webservice/server.php?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>urn:server.issqn#gravaNotaXML</WebActionHomologacao>
			<WebActionProducao>urn:server.issqn#gravaNotaXML</WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=ISO-8859-1</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="urn:server.issqn" xmlns:types="urn:server.issqn/encodedTypes" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><tns:gravaNotaXML><params xsi:type="xsd:string">&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;{xmlBodyScape}</params></tns:gravaNotaXML></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns1:gravaNotaXMLResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<UsaCertificadoDigital>false</UsaCertificadoDigital>
			<TargetNS>urn:server.issqn</TargetNS>
		</GerarNfse>
		<ConsultarNfse versao="1.00">
			<Descricao>Consulta de Nota Fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao>https://votuporanga.prefeitura.rlz.com.br/webservices/nfse/server.php?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://web.votuporanga.sp.gov.br/amfphp/services/RLZ/webservice/server.php?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>urn:server.issqn#listarNotasXML</WebActionHomologacao>
			<WebActionProducao>urn:server.issqn#listarNotasXML</WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=ISO-8859-1</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="urn:server.issqn" xmlns:types="urn:server.issqn/encodedTypes" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><tns:listarNotasXML><params xsi:type="xsd:string">{xmlBodyScape}</params></tns:listarNotasXML></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns1:listarNotasXMLResponse</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<UsaCertificadoDigital>false</UsaCertificadoDigital>
			<TargetNS>urn:server.issqn</TargetNS>
		</ConsultarNfse>
	</Servicos>
</Configuracoes>